---
kind: property
id: P:Autodesk.Revit.DB.SpatialElementTag.IsTaggingLink
source: html/75f8aca2-6dbe-c124-02fa-001620407989.htm
---
# Autodesk.Revit.DB.SpatialElementTag.IsTaggingLink Property

Identifies if the tag has reference to a spatial element in a linked document or not.

## Syntax (C#)
```csharp
public bool IsTaggingLink { get; }
```